In [1]:
import numpy as np

In [2]:
arr = np.array([10,20,30,40,50])

In [3]:
print("Array:",arr)

Array: [10 20 30 40 50]

In [4]:
print("Mean:",np.mean(arr))

Mean: 30.0

In [5]:
print("Sum:",np.sum(arr))

Sum: 150

In [6]:
print("Standard Deviation:",np.std(arr))

Standard Deviation: 14.142135623730951

In [7]:
print("Array squared:",arr**2)

Array squared: [ 100  400  900 1600 2500]

In [8]:
import random

In [13]:

arr2 = np.random.randint(1,11,(5,2))
print("Mean:",np.mean(arr2))
print("Sum:",np.sum(arr2))
print("Standard Deviation:",np.std(arr2))

Mean: 6.0
Sum: 60
Standard Deviation: 2.6076809620810595

In [11]:
arr2

array([[1, 3],
       [8, 6],
       [3, 5],
       [8, 4],
       [1, 2]])

In [22]:
arr3 = np.arange(1,13).reshape(4,3)

In [25]:
print(arr3)
print(arr3[1][1])

[[ 1  2  3]
 [ 4  5  6]
 [ 7  8  9]
 [10 11 12]]
5

In [19]:
print(arr3[0])

[1 2 3 4]

In [21]:
print(arr3[1][2])

7

In [26]:
random_arr = np.random.randint(1,100,(5,5))

In [27]:
random_arr

array([[99, 40,  9, 75, 46],
       [99, 96, 30,  6, 31],
       [49, 11, 77, 51,  3],
       [46, 52, 70, 89, 55],
       [78, 79, 50, 33, 51]])

In [34]:
random_arr2 = np.random.rand(5,5)

In [35]:
random_arr2

array([[0.92078738, 0.84652774, 0.78654077, 0.72278614, 0.38202459],
       [0.11464187, 0.953773  , 0.32501685, 0.47422966, 0.32381615],
       [0.83780873, 0.40615403, 0.70042505, 0.61988245, 0.19027681],
       [0.32016813, 0.4348843 , 0.81745746, 0.37919951, 0.70049769],
       [0.12030827, 0.31632343, 0.60546016, 0.4568147 , 0.24526591]])

##### PANDAS

In [36]:
import pandas as pd

In [38]:
data = {
    "Name":["Alice","Serna","Ketsia","Tychique","Keren"],
    "Age":[20,22,8,20,17],
    "City":["Joburg","Cape Town","Tokyo","Seoul","Bangkok"]
}

In [39]:
data_frame = pd.DataFrame(data)

In [40]:
print(data_frame)

       Name  Age       City
0     Alice   20     Joburg
1     Serna   22  Cape Town
2    Ketsia    8      Tokyo
3  Tychique   20      Seoul
4     Keren   17    Bangkok

In [41]:
print(data_frame.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes
None

In [42]:
print(data_frame.describe())

             Age
count   5.000000
mean   17.400000
std     5.549775
min     8.000000
25%    17.000000
50%    20.000000
75%    20.000000
max    22.000000

In [44]:
data_frame["Salary"] = [20000,10000,1000000,0,0]

In [45]:
data_frame

       Name  Age       City   Salary
0     Alice   20     Joburg    20000
1     Serna   22  Cape Town    10000
2    Ketsia    8      Tokyo  1000000
3  Tychique   20      Seoul        0
4     Keren   17    Bangkok        0

In [47]:
data_frame.iloc[0]

Name       Alice
Age           20
City      Joburg
Salary     20000
Name: 0, dtype: object

In [50]:
data_frame.Name

0       Alice
1       Serna
2      Ketsia
3    Tychique
4       Keren
Name: Name, dtype: object

In [52]:
data_frame.Salary

0      20000
1      10000
2    1000000
3          0
4          0
Name: Salary, dtype: int64

In [56]:
data_frame[["Name","Salary"]]

       Name   Salary
0     Alice    20000
1     Serna    10000
2    Ketsia  1000000
3  Tychique        0
4     Keren        0

#### CSV FILES

In [61]:
data_frame.to_csv("people_data.csv",index=False)

In [62]:
data_frame_csv = pd.read_csv("people_data.csv")

In [63]:
print(data_frame_csv.head())

       Name  Age       City   Salary
0     Alice   20     Joburg    20000
1     Serna   22  Cape Town    10000
2    Ketsia    8      Tokyo  1000000
3  Tychique   20      Seoul        0
4     Keren   17    Bangkok        0

In [65]:
print(data_frame_csv.columns)

Index(['Name', 'Age', 'City', 'Salary'], dtype='object')

In [66]:
data_frame_csv["Age"]

0    20
1    22
2     8
3    20
4    17
Name: Age, dtype: int64

In [68]:
data_frame_csv["Age"].mean()

17.4

In [69]:
data_frame_csv

       Name  Age       City   Salary
0     Alice   20     Joburg    20000
1     Serna   22  Cape Town    10000
2    Ketsia    8      Tokyo  1000000
3  Tychique   20      Seoul        0
4     Keren   17    Bangkok        0

In [72]:
del data_frame_csv["City"]

In [73]:
data_frame_csv

       Name  Age   Salary
0     Alice   20    20000
1     Serna   22    10000
2    Ketsia    8  1000000
3  Tychique   20        0
4     Keren   17        0